app/graphql/mutations/make_payment.rb

INSERT INTO "payments" ("amount", "sender_id", "recipient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", 2000.0], ["sender_id", 1], ["recipient_id", 2], ["created_at", "2024-03-26 21:58:26.740724"], ["updated_at", "2024-03-26 21:58:26.740724"]]
---
    def resolve(**arg)
      payment =  Payment.new(arg)

      if payment.save