app/graphql/types/query_type.rb

    def user(id:)
      User.find(id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def payment(id:)
      Payment.find(id)
---
SELECT "payments".* FROM "payments" WHERE "payments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]